#include<stdio.h>
int main()
{
    // printf("请输入一个三位数：\n");
    // int a;
    // int b;
    // int c;
    // int d;
    // while(scanf("%d",&a)&& a != 0)
    // {
    //     b = a % 10;
    //     a = a / 10;
    //     c = a % 10;
    //     a = a / 10;
    //     d = a % 10;
    //     printf("倒置后为：%d%d%d\n",b,c,d);
    // }
    //这个代码的弊端：
    //1、太复杂，并且未利用while循环的循环输出能力
    //2、只能倒置三位数
    printf("请输入想要倒置的数字：\n");
    int a;
    //while(scanf("%d",&a)&& a!=-1)
    // {
    //     printf("%d",a % 10);
    //     a = a / 10 
    // }
    //不能这样写！
    //while是循环，while（scanf....）是循环执行输入scanf值
    //scanf 放进 while 里，程序每循环一次，就要求你从键盘上重新敲一个数字。
    //第一步while：scanf输入值。e.g：1234
    // 第二步打印余数4
    // 第三步：a =  a / 10;a变成123
    // 第四步：返回while又继续开始第一步，也就是输入新的一组数字
    // 所以导致输出总是只输出最后一个数字 
    
   while(scanf("%d",&a)!= -1 && a != 0)
   //加上一个！=-1防止在control+d时陷入死循环
   //之前没加！=-1导致程序识别到为-1，而基础知识得知
   //0为假，非零为真。所以control+d向电脑传入为-1，
   //这个时候程序判断事件为真，就会一直陷入循环。
    
    {
        int b = a;
        //这里嵌套了一个内循环
        //第一步：scanf输入数字如：123
        //第二步：b=123
        //第三步：内循环：b % 10——》打印3
                    //接着b = b / 10;——》b=12
                    //再打印2
                    //接着b = b / 10;——》b=1
                    //再打印1
                    //接着b = b / 10;——》b=0，此时b=0内循环完成，返回外循环
        //外循环重新执行scanf，准备读入下一个数字。
        while(b != 0)
        {
            printf("%d",b % 10);
            b = b / 10;
        }     
        
    }
    return 0;
}